In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

import warnings
warnings.filterwarnings("ignore")  # to suppress all warnings

In [2]:
# !pip install xlrd
# !pip install lxml
# !pip install openpyxl

In [3]:
df = pd.read_excel("text_exercise.xlsx")
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      object
 1   staff       8 non-null      object
 2   department  8 non-null      object
 3   job         8 non-null      object
 4   salary      8 non-null      object
 5   age         8 non-null      object
dtypes: object(6)
memory usage: 512.0+ bytes

In [5]:
df["staff"].str.lower()

0         tom blue
1       john black
2    micheal brown
3     jason walker
4       alex green
5     oscar smi̇th
6      adrian star
7     albert simon
Name: staff, dtype: object

In [6]:
df.staff.str.upper()

0         TOM BLUE
1       JOHN BLACK
2    MICHEAL BROWN
3     JASON WALKER
4       ALEX GREEN
5      OSCAR SMİTH
6      ADRIAN STAR
7     ALBERT SIMON
Name: staff, dtype: object

In [7]:
df.staff.str.title()

0         Tom Blue
1       John Black
2    Micheal Brown
3     Jason Walker
4       Alex Green
5     Oscar Smi̇th
6      Adrian Star
7     Albert Simon
Name: staff, dtype: object

In [8]:
df.staff.str.capitalize()

0         Tom blue
1       John black
2    Micheal brown
3     Jason walker
4       Alex green
5     Oscar smi̇th
6      Adrian star
7     Albert simon
Name: staff, dtype: object

In [9]:
df.staff.str.swapcase()

0         tOM blue
1       john black
2    mICHEAL bROWN
3     JASON WALKER
4       aLEX gREEN
5     oscar smi̇th
6      aDRIAN star
7     aLBERT SIMON
Name: staff, dtype: object

In [10]:
# Let us remember our df

df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [11]:
df.job.str.isalpha()

0     True
1     True
2    False
3     True
4    False
5    False
6    False
7    False
Name: job, dtype: bool

In [12]:
df.age.str.isnumeric()

0      NaN
1      NaN
2      NaN
3      NaN
4    False
5      NaN
6      NaN
7      NaN
Name: age, dtype: object

In [13]:
df.age.astype("string").str.isnumeric()

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
Name: age, dtype: boolean

In [14]:
df.salary.str.isalnum()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

In [15]:
df.job.str.startswith("d")

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

In [16]:
df.job.str.endswith("per")

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
Name: job, dtype: bool

In [17]:
df.job.str.contains("data")

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

In [18]:
df.salary.str.contains("[a-z]+")

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

In [19]:
df[df.job.str.contains("data")]

      id          staff department             job       salary age
2  E0001  Micheal Brown         IT  data scientist   "$150,000"  35
6  E0005    Adrian STAR         IT  data scientist   "$135,000"  40
7  E0006   Albert simon         IT  data scientist  125000dolar  35

In [20]:
df.loc[df.job.str.contains("data"), "department"]

2    IT
6    IT
7    IT
Name: department, dtype: object

In [21]:
df.loc[df.job.str.contains("data"), "department"] = "DS"
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         DS      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         DS      data scientist   "$135,000"  40
7  E0006   Albert simon         DS      data scientist  125000dolar  35

In [22]:
df.loc[df.job.str.contains("data"), "department"] = "IT"
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [23]:
# Let's remember our df

df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [24]:
df.salary.str.strip("\"")

0       $150,000
1       $180,000
2       $150,000
3    130000dolar
4       $110,000
5       $120,000
6       $135,000
7    125000dolar
Name: salary, dtype: object

In [25]:
df.salary.str.strip('"')

0       $150,000
1       $180,000
2       $150,000
3    130000dolar
4       $110,000
5       $120,000
6       $135,000
7    125000dolar
Name: salary, dtype: object

In [26]:
df.salary.str.strip("\"").str.rstrip("dolar")

0    $150,000
1    $180,000
2    $150,000
3      130000
4    $110,000
5    $120,000
6    $135,000
7      125000
Name: salary, dtype: object

In [27]:
df.salary.str.strip("\"").str.rstrip("dolar").str.lstrip("$")

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [28]:
df.salary.str.strip("\"dolar$")

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [29]:
df.salary.str.strip("\"dolar$").str.replace(",", "")

#df.salary.str.strip("\"dolar$").replace(",", "") # "replace" method without "str" seeks specified character/characters as a full match

0    150000
1    180000
2    150000
3    130000
4    110000
5    120000
6    135000
7    125000
Name: salary, dtype: object

In [30]:
df.salary.str.strip("\"dolar$").str.replace(",", "").astype(float)

0    150000.0
1    180000.0
2    150000.0
3    130000.0
4    110000.0
5    120000.0
6    135000.0
7    125000.0
Name: salary, dtype: float64

In [31]:
df["salary"] = df.salary.str.strip("\"dolar$").str.replace(",", "").astype(float)
df.salary

0    150000.0
1    180000.0
2    150000.0
3    130000.0
4    110000.0
5    120000.0
6    135000.0
7    125000.0
Name: salary, dtype: float64

In [32]:
df.age

0    52
1    48
2    35
3    38
4     -
5    32
6    40
7    35
Name: age, dtype: object

In [33]:
print(df.age.dtype)
print(type(df.age[0]))
print(type(df.age[4]))

# print(df.age.dtype, type(df.age[0]), type(df.age[4]))

object
<class 'int'>
<class 'str'>

In [34]:
df.age.replace("-", np.nan)

#df.age.str.replace("-", np.nan) # gives an error

0    52.0
1    48.0
2    35.0
3    38.0
4     NaN
5    32.0
6    40.0
7    35.0
Name: age, dtype: float64

In [35]:
df["age"] = df.age.replace("-", np.nan)
df.age

0    52.0
1    48.0
2    35.0
3    38.0
4     NaN
5    32.0
6    40.0
7    35.0
Name: age, dtype: float64

In [36]:
df.staff

0         Tom BLUE
1       JOHN BLACK
2    Micheal Brown
3     jason walker
4       Alex Green
5      OSCAR SMİTH
6      Adrian STAR
7     Albert simon
Name: staff, dtype: object

In [37]:
df.staff.str.title().str.split().str[0]

df.staff.str.title().str.split().str.get(0)

0        Tom
1       John
2    Micheal
3      Jason
4       Alex
5      Oscar
6     Adrian
7     Albert
Name: staff, dtype: object

In [38]:
df["first_name"] = df.staff.str.title().str.split().str[0]
df["last_name"] = df.staff.str.title().str.split().str[1]
df.drop("staff", axis=1, inplace=True)

In [39]:
df

      id department                 job    salary   age first_name last_name
0  M0001         HR             manager  150000.0  52.0        Tom      Blue
1  M0002         IT             manager  180000.0  48.0       John     Black
2  E0001         IT      data scientist  150000.0  35.0    Micheal     Brown
3  E0002         HR           recruiter  130000.0  38.0      Jason    Walker
4  E0003         IT   backend developer  110000.0   NaN       Alex     Green
5  E0004         IT  frontend developer  120000.0  32.0      Oscar    Smi̇th
6  E0005         IT      data scientist  135000.0  40.0     Adrian      Star
7  E0006         IT      data scientist  125000.0  35.0     Albert     Simon

In [40]:
df.job

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

In [41]:
df.job.str.find("developer")

0   -1
1   -1
2   -1
3   -1
4    8
5    9
6   -1
7   -1
Name: job, dtype: int64

**str.findall** finds all occurrences of pattern or regular expression in the Series/Index [SOURCE](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.findall.html).

In [42]:
df.job.str.findall("developer")

0             []
1             []
2             []
3             []
4    [developer]
5    [developer]
6             []
7             []
Name: job, dtype: object

In [43]:
df.job.str.findall("d")

0        []
1        []
2       [d]
3        []
4    [d, d]
5    [d, d]
6       [d]
7       [d]
Name: job, dtype: object

In [44]:
# Let's add new features named "skils" and "Skills" to our DataFrame

df["skills"] = [[], ["Java", "C++"], ["Python", "Tableau", "SQL"], [], ["React", "Django"], ["JavaScript", "Python"], ["R", "SQL"], ["SQL", "Python"]]
df["Skills"] = [[], [], ["Python","Tableau","SQL"], [], ["React", "Django"], ["JavaScript", "Python"], ["R", "SQL"], ["SQL", "Python"]]
df.loc[1, "Skills"] = "Java, C++"
df

,id,department,job,salary,age,first_name,last_name,skills,Skills
0,M0001,HR,manager,150000.0,52.0,Tom,Blue,[],[]
1,M0002,IT,manager,180000.0,48.0,John,Black,"[Java, C++]","Java, C++"
2,E0001,IT,data scientist,150000.0,35.0,Micheal,Brown,"[Python, Tableau, SQL]","[Python, Tableau, SQL]"
3,E0002,HR,recruiter,130000.0,38.0,Jason,Walker,[],[]
4,E0003,IT,backend developer,110000.0,NaN,Alex,Green,"[React, Django]","[React, Django]"
5,E0004,IT,frontend developer,120000.0,32.0,Oscar,Smi̇th,"[JavaScript, Python]","[JavaScript, Python]"
6,E0005,IT,data scientist,135000.0,40.0,Adrian,Star,"[R, SQL]","[R, SQL]"
7,E0006,IT,data scientist,125000.0,35.0,Albert,Simon,"[SQL, Python]","[SQL, Python]"

In [45]:
df.skills.str.join(",")

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: skills, dtype: object

In [46]:
df.Skills.str.join(",")

0
1     J,a,v,a,,, ,C,+,+
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [47]:
df.Skills.apply(lambda item: ",".join(item) if type(item) == list else item)

0
1             Java, C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [48]:
[",".join(item) if type(item) == list else item for item in df.Skills]

['',
 'Java, C++',
 'Python,Tableau,SQL',
 '',
 'React,Django',
 'JavaScript,Python',
 'R,SQL',
 'SQL,Python']

In [49]:
df["Skills"] = [",".join(item) if type(item) == list else item for item in df.Skills]
df.Skills

0
1             Java, C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [50]:
df

,id,department,job,salary,age,first_name,last_name,skills,Skills
0,M0001,HR,manager,150000.0,52.0,Tom,Blue,[],
1,M0002,IT,manager,180000.0,48.0,John,Black,"[Java, C++]","Java, C++"
2,E0001,IT,data scientist,150000.0,35.0,Micheal,Brown,"[Python, Tableau, SQL]","Python,Tableau,SQL"
3,E0002,HR,recruiter,130000.0,38.0,Jason,Walker,[],
4,E0003,IT,backend developer,110000.0,NaN,Alex,Green,"[React, Django]","React,Django"
5,E0004,IT,frontend developer,120000.0,32.0,Oscar,Smi̇th,"[JavaScript, Python]","JavaScript,Python"
6,E0005,IT,data scientist,135000.0,40.0,Adrian,Star,"[R, SQL]","R,SQL"
7,E0006,IT,data scientist,125000.0,35.0,Albert,Simon,"[SQL, Python]","SQL,Python"

In [51]:
pd.get_dummies(df.department)

   HR  IT
0   1   0
1   0   1
2   0   1
3   1   0
4   0   1
5   0   1
6   0   1
7   0   1

In [52]:
pd.get_dummies(df.department, drop_first=True)

   IT
0   0
1   1
2   1
3   0
4   1
5   1
6   1
7   1

In [53]:
df.Skills

0
1             Java, C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [54]:
df.Skills.str.get_dummies(sep=",")

    C++  Django  Java  JavaScript  Python  R  React  SQL  Tableau
0     0       0     0           0       0  0      0    0        0
1     1       0     1           0       0  0      0    0        0
2     0       0     0           0       1  0      0    1        1
3     0       0     0           0       0  0      0    0        0
4     0       1     0           0       0  0      1    0        0
5     0       0     0           1       1  0      0    0        0
6     0       0     0           0       0  1      0    1        0
7     0       0     0           0       1  0      0    1        0

In [55]:
df.Skills.str.get_dummies(sep=",").add_prefix("skills_")

,skills_ C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau
0,0,0,0,0,0,0,0,0,0
1,1,0,1,0,0,0,0,0,0
2,0,0,0,0,1,0,0,1,1
3,0,0,0,0,0,0,0,0,0
4,0,1,0,0,0,0,1,0,0
5,0,0,0,1,1,0,0,0,0
6,0,0,0,0,0,1,0,1,0
7,0,0,0,0,1,0,0,1,0

In [56]:
skills_dummy = df.Skills.str.get_dummies(sep=",").add_prefix("skills_")

In [57]:
df_final = df[["department", "job", "salary", "Skills"]]
df_final

  department                 job    salary              Skills
0         HR             manager  150000.0
1         IT             manager  180000.0           Java, C++
2         IT      data scientist  150000.0  Python,Tableau,SQL
3         HR           recruiter  130000.0
4         IT   backend developer  110000.0        React,Django
5         IT  frontend developer  120000.0   JavaScript,Python
6         IT      data scientist  135000.0               R,SQL
7         IT      data scientist  125000.0          SQL,Python

In [58]:
df_final.join(skills_dummy)

,department,job,salary,Skills,skills_ C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau
0,HR,manager,150000.0,,0,0,0,0,0,0,0,0,0
1,IT,manager,180000.0,"Java, C++",1,0,1,0,0,0,0,0,0
2,IT,data scientist,150000.0,"Python,Tableau,SQL",0,0,0,0,1,0,0,1,1
3,HR,recruiter,130000.0,,0,0,0,0,0,0,0,0,0
4,IT,backend developer,110000.0,"React,Django",0,1,0,0,0,0,1,0,0
5,IT,frontend developer,120000.0,"JavaScript,Python",0,0,0,1,1,0,0,0,0
6,IT,data scientist,135000.0,"R,SQL",0,0,0,0,0,1,0,1,0
7,IT,data scientist,125000.0,"SQL,Python",0,0,0,0,1,0,0,1,0

In [59]:
df_final = df_final.join(skills_dummy)
df_final.drop("Skills", axis=1, inplace=True)

In [60]:
df_final

,department,job,salary,skills_ C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau
0,HR,manager,150000.0,0,0,0,0,0,0,0,0,0
1,IT,manager,180000.0,1,0,1,0,0,0,0,0,0
2,IT,data scientist,150000.0,0,0,0,0,1,0,0,1,1
3,HR,recruiter,130000.0,0,0,0,0,0,0,0,0,0
4,IT,backend developer,110000.0,0,1,0,0,0,0,1,0,0
5,IT,frontend developer,120000.0,0,0,0,1,1,0,0,0,0
6,IT,data scientist,135000.0,0,0,0,0,0,1,0,1,0
7,IT,data scientist,125000.0,0,0,0,0,1,0,0,1,0

In [61]:
pd.get_dummies(df_final, drop_first = True)

,salary,skills_ C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau,department_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,150000.0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
1,180000.0,1,0,1,0,0,0,0,0,0,1,0,0,1,0
2,150000.0,0,0,0,0,1,0,0,1,1,1,1,0,0,0
3,130000.0,0,0,0,0,0,0,0,0,0,0,0,0,0,1
4,110000.0,0,1,0,0,0,0,1,0,0,1,0,0,0,0
5,120000.0,0,0,0,1,1,0,0,0,0,1,0,1,0,0
6,135000.0,0,0,0,0,0,1,0,1,0,1,1,0,0,0
7,125000.0,0,0,0,0,1,0,0,1,0,1,1,0,0,0

In [62]:
df_final = pd.get_dummies(df_final, drop_first = True)
df_final

,salary,skills_ C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau,department_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,150000.0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
1,180000.0,1,0,1,0,0,0,0,0,0,1,0,0,1,0
2,150000.0,0,0,0,0,1,0,0,1,1,1,1,0,0,0
3,130000.0,0,0,0,0,0,0,0,0,0,0,0,0,0,1
4,110000.0,0,1,0,0,0,0,1,0,0,1,0,0,0,0
5,120000.0,0,0,0,1,1,0,0,0,0,1,0,1,0,0
6,135000.0,0,0,0,0,0,1,0,1,0,1,1,0,0,0
7,125000.0,0,0,0,0,1,0,0,1,0,1,1,0,0,0

In [63]:
# pd.read_csv("time_exercise.csv", parse_dates=["entry_date", "order_date"]

df = pd.read_csv("time_exercise.csv")
df.head()

   id_product  order_date  product_quantity  product_price  entry_date
0         401  2021-01-23               1.0     541.487603  2018-12-04
1         416  2020-04-02               1.0     131.181818  2018-12-04
2         717  2019-03-10               1.0    2035.488500  2018-12-04
3         778  2019-12-27               1.0     335.988000  2018-12-04
4         826  2020-02-19               1.0     342.292302  2018-12-04

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    object
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    object
dtypes: float64(2), int64(1), object(2)
memory usage: 35.7+ KB

In [65]:
df["order_date"]

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: object

In [66]:
pd.to_datetime(df["order_date"])

0     2021-01-23
1     2020-04-02
2     2019-03-10
3     2019-12-27
4     2020-02-19
         ...
906   2020-11-24
907   2020-11-24
908   2020-11-22
909   2021-01-26
910   2020-12-06
Name: order_date, Length: 911, dtype: datetime64[ns]

In [67]:
df["entry_date"] = pd.to_datetime(df["entry_date"])
df["order_date"] = pd.to_datetime(df["order_date"])

In [68]:
df.head()

   id_product order_date  product_quantity  product_price entry_date
0         401 2021-01-23               1.0     541.487603 2018-12-04
1         416 2020-04-02               1.0     131.181818 2018-12-04
2         717 2019-03-10               1.0    2035.488500 2018-12-04
3         778 2019-12-27               1.0     335.988000 2018-12-04
4         826 2020-02-19               1.0     342.292302 2018-12-04

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    datetime64[ns]
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(1)
memory usage: 35.7 KB

Now let's apply some aggregate methods for Datatime object at the given dataset:

In [70]:
df.entry_date.min()

Timestamp('2018-12-04 00:00:00')

In [71]:
df.entry_date.max()

Timestamp('2020-11-26 00:00:00')

In [72]:
df.entry_date.max() - df.entry_date.min()

Timedelta('723 days 00:00:00')

In [73]:
a = pd.Series(["15-03-2020", "18-05-2019", "24-07-2018"])
a

0    15-03-2020
1    18-05-2019
2    24-07-2018
dtype: object

In [74]:
a.max()

'24-07-2018'

In [75]:
# a.max() - a.min()

# # Give an error of "TypeError: unsupported operand type(s) for -: 'str' and 'str'""

In [76]:
pd.to_datetime(a, format='%d-%m-%Y')

0   2020-03-15
1   2019-05-18
2   2018-07-24
dtype: datetime64[ns]

In [77]:
a = pd.to_datetime(a, format='%d-%m-%Y')
a

0   2020-03-15
1   2019-05-18
2   2018-07-24
dtype: datetime64[ns]

In [78]:
k = pd.to_datetime(a, format='%d-%m-%Y').max()
k

Timestamp('2020-03-15 00:00:00')

In [79]:
s = pd.to_datetime(a, format='%d-%m-%Y').min()
s

Timestamp('2018-07-24 00:00:00')

In [80]:
k - s

Timedelta('600 days 00:00:00')

In [81]:
df["entry_date"].dt.year 

# it can be date, year, quarter, month, week, day, weekday, dayofweek, hour, minute, second, microsecond

0      2018
1      2018
2      2018
3      2018
4      2018
       ...
906    2020
907    2020
908    2020
909    2020
910    2020
Name: entry_date, Length: 911, dtype: int64

In [82]:
df.entry_date.dt.quarter

0      4
1      4
2      4
3      4
4      4
      ..
906    4
907    4
908    4
909    4
910    4
Name: entry_date, Length: 911, dtype: int64

In [83]:
df.entry_date.dt.dayofweek

0      1
1      1
2      1
3      1
4      1
      ..
906    2
907    2
908    4
909    1
910    3
Name: entry_date, Length: 911, dtype: int64

In [84]:
from datetime import datetime

In [85]:
datetime.now()

datetime.datetime(2022, 9, 1, 8, 21, 0, 354847)

In [86]:
print(datetime.now())

2022-09-01 08:21:00.453884

In [87]:
print(datetime.today())

2022-09-01 08:21:00.595433

In [88]:
current_datetime = datetime.now()

print(current_datetime)

2022-09-01 08:21:00.680265

In [89]:
current_datetime.date() 

# it can be date, year, month, day, weekday, isoweekday, hour, minute, second, microsecond, tzinfo

datetime.date(2022, 9, 1)

In [90]:
current_datetime.year

2022

In [91]:
current_datetime.weekday() 

# Return the day of the week as an integer, where Monday is 0 and Sunday is 6.

3

In [92]:
current_datetime.isoweekday() 

# Return the day of the week as an integer, where Monday is 1 and Sunday is 7.

4

In [93]:
from datetime import timedelta

In [94]:
timedelta(days=2)

datetime.timedelta(days=2)

In [95]:
print(timedelta(days=2))

2 days, 0:00:00

In [96]:
current_datetime

datetime.datetime(2022, 9, 1, 8, 21, 0, 680265)

In [97]:
two_days_before = current_datetime - timedelta(days=2)
two_days_before

datetime.datetime(2022, 8, 30, 8, 21, 0, 680265)

In [98]:
current_datetime + timedelta(weeks=2, days=3, hours=4, minutes=10)

datetime.datetime(2022, 9, 18, 12, 31, 0, 680265)

In [99]:
print(f"{'current_date': <15}", current_datetime)

print(f"{'plus': <15}", timedelta(weeks=2, hours=4, minutes=10))

print(f"{'total': <15}", current_datetime + timedelta(weeks=2, days=3, hours=4, minutes=10))

current_date    2022-09-01 08:21:00.680265
plus            14 days, 4:10:00
total           2022-09-18 12:31:00.680265

In [100]:
current_datetime

datetime.datetime(2022, 9, 1, 8, 21, 0, 680265)

In [101]:
print(current_datetime)

2022-09-01 08:21:00.680265

In [102]:
current_datetime.year

2022

In [103]:
type(current_datetime.year)  # This is class datetime.datetime provided by Datetime Module

int

In [104]:
current_datetime.strftime("%Y")  # This is a strftime(format) method provided by Datetime Module

'2022'

In [105]:
type(current_datetime.strftime("%Y"))

str

In [106]:
year = current_datetime.strftime("%Y")
print("year:", year)
print("year's type is:", type(year), "\n")

month = current_datetime.strftime("%m")
print("month:", month)
print("month's type is:", type(month), "\n")

day = current_datetime.strftime("%d")
print("day:", day)
print("day's type is:", type(day), "\n")

time = current_datetime.strftime("%H:%M:%S")
print("time:", time)
print("time's type is:", type(time), "\n")

date_time = current_datetime.strftime("%m/%d/%Y, %H:%M:%S")
print("date and time:", date_time)
print("date_time's type is:", type(date_time), "\n")

year: 2022
year's type is: <class 'str'>

month: 09
month's type is: <class 'str'>

day: 01
day's type is: <class 'str'>

time: 08:21:00
time's type is: <class 'str'>

date and time: 09/01/2022, 08:21:00
date_time's type is: <class 'str'>

### [strptime()](https://docs.python.org/3/library/datetime.html)

**Converting** from string type **to datetime object**

In [107]:
date_string = "21 June, 2018"
date_string

'21 June, 2018'

In [108]:
datetime.strptime(date_string, "%d %B, %Y")

#datetime.strptime(date_string) # gives an error

datetime.datetime(2018, 6, 21, 0, 0)

In [109]:
pd.to_datetime(date_string)

Timestamp('2018-06-21 00:00:00')

In [110]:
datetime_object = datetime.strptime(date_string, "%d %B, %Y")
datetime_object

datetime.datetime(2018, 6, 21, 0, 0)

In [111]:
type(datetime_object)

datetime.datetime

In [112]:
datetime_object.year

2018

In [113]:
# Let's remember our df

df

     id_product order_date  product_quantity  product_price entry_date
0           401 2021-01-23               1.0     541.487603 2018-12-04
1           416 2020-04-02               1.0     131.181818 2018-12-04
2           717 2019-03-10               1.0    2035.488500 2018-12-04
3           778 2019-12-27               1.0     335.988000 2018-12-04
4           826 2020-02-19               1.0     342.292302 2018-12-04
..          ...        ...               ...            ...        ...
906     1536842 2020-11-24               1.0    1186.776860 2020-10-07
907     1536842 2020-11-24               1.0    1186.776860 2020-10-07
908     1536887 2020-11-22               1.0       0.000000 2020-11-13
909     1536952 2021-01-26               1.0     988.429752 2020-11-24
910     1536974 2020-12-06               1.0       0.000000 2020-11-26

[911 rows x 5 columns]

In [114]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    datetime64[ns]
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(1)
memory usage: 35.7 KB

**Let us do it by string methods**

In [115]:
df["order_date"] - df["entry_date"]

0     781 days
1     485 days
2      96 days
3     388 days
4     442 days
        ...
906    48 days
907    48 days
908     9 days
909    63 days
910    10 days
Length: 911, dtype: timedelta64[ns]

In [116]:
df["time_delta"] = df["order_date"] - df["entry_date"]
df.head(3)

,id_product,order_date,product_quantity,product_price,entry_date,time_delta
0,401,2021-01-23,1.0,541.487603,2018-12-04,781 days
1,416,2020-04-02,1.0,131.181818,2018-12-04,485 days
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96 days

In [117]:
df["time_delta"].astype("str").str.split(" ").str[0].astype(int)

0      781
1      485
2       96
3      388
4      442
      ...
906     48
907     48
908      9
909     63
910     10
Name: time_delta, Length: 911, dtype: int32

In [118]:
df["time_delta"] = df["time_delta"].astype("str").str.split(" ").str[0].astype(int)
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta
0,401,2021-01-23,1.0,541.487603,2018-12-04,781
1,416,2020-04-02,1.0,131.181818,2018-12-04,485
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96
3,778,2019-12-27,1.0,335.988000,2018-12-04,388
4,826,2020-02-19,1.0,342.292302,2018-12-04,442
...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10

In [119]:
df.groupby("id_product")["time_delta"].min()

id_product
401        781
416        485
717         96
778        388
826        442
          ...
1536841     38
1536842     48
1536887      9
1536952     63
1536974     10
Name: time_delta, Length: 498, dtype: int32

In [120]:
df.groupby("id_product")["time_delta"].transform(min)

0      781
1      485
2       96
3      388
4      442
      ...
906     48
907     48
908      9
909     63
910     10
Name: time_delta, Length: 911, dtype: int32

In [121]:
df["passing_time_to_firstsale"] = df.groupby("id_product")["time_delta"].transform(min)
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781,781
1,416,2020-04-02,1.0,131.181818,2018-12-04,485,485
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96,96
3,778,2019-12-27,1.0,335.988000,2018-12-04,388,388
4,826,2020-02-19,1.0,342.292302,2018-12-04,442,442
...,...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9,9
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63,63
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10,10

In [122]:
df.sample(10)

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale
131,3674,2020-05-07,1.0,607.1868,2018-12-04,520,195
57,2925,2019-11-06,1.0,383.9880,2018-12-04,337,337
623,10097,2019-10-22,1.0,1633.8000,2018-12-04,322,322
332,4176,2020-05-06,1.0,349.7868,2018-12-04,519,519
771,1525105,2019-07-06,1.0,1300.5000,2018-12-04,214,103
210,3726,2019-12-15,1.0,407.9880,2018-12-04,376,337
749,1525099,2019-11-21,1.0,221.0000,2018-12-04,352,325
401,4792,2020-11-23,1.0,49.5600,2018-12-04,720,482
126,3674,2020-03-14,1.0,607.1868,2018-12-04,466,195
424,5007,2020-01-17,1.0,83.5800,2018-12-04,409,392

In [123]:
df[(df.time_delta != df.passing_time_to_firstsale)]

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale
15,1031,2018-12-16,1.0,234.990000,2018-12-04,12,-16
25,1410,2020-11-29,1.0,227.988000,2018-12-04,726,404
39,2051,2020-10-21,1.0,329.000000,2018-12-04,687,670
41,2065,2019-06-20,1.0,246.662350,2018-12-04,198,-17
43,2072,2019-07-03,1.0,189.737350,2018-12-04,211,185
...,...,...,...,...,...,...,...
898,1536753,2020-09-04,1.0,450.000000,2020-08-15,20,-38
899,1536753,2020-11-23,1.0,450.000000,2020-08-15,100,-38
900,1536753,2020-11-25,2.0,408.000000,2020-08-15,102,-38
904,1536841,2020-11-20,1.0,988.429752,2020-10-07,44,38
905,1536841,2020-11-22,1.0,988.429752,2020-10-07,46,38

In [124]:
df.groupby("id_product")["id_product"].count().sort_values(ascending=False)

id_product
3674       33
3671       21
3711       15
11364      13
1525105    13
           ..
4791        1
4745        1
4713        1
4699        1
1536974     1
Name: id_product, Length: 498, dtype: int64

In [125]:
df[(df.id_product == 3674)].sort_values("time_delta")

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale
116,3674,2019-06-17,1.0,528.988500,2018-12-04,195,195
117,3674,2020-01-08,1.0,551.988000,2018-12-04,400,195
118,3674,2020-01-13,1.0,551.988000,2018-12-04,405,195
119,3674,2020-01-23,1.0,551.988000,2018-12-04,415,195
120,3674,2020-01-28,1.0,551.988000,2018-12-04,420,195
121,3674,2020-02-16,1.0,607.186800,2018-12-04,439,195
122,3674,2020-02-21,1.0,607.186800,2018-12-04,444,195
123,3674,2020-03-06,1.0,607.186800,2018-12-04,458,195
124,3674,2020-03-08,1.0,607.186800,2018-12-04,460,195
125,3674,2020-03-09,1.0,607.186800,2018-12-04,461,195
126,3674,2020-03-14,1.0,607.186800,2018-12-04,466,195
127,3674,2020-04-12,1.0,607.186800,2018-12-04,495,195
128,3674,2020-04-20,1.0,607.186800,2018-12-04,503,195
129,3674,2020-04-23,2.0,607.186800,2018-12-04,506,195
130,3674,2020-04-26,1.0,607.186800,2018-12-04,509,195
131,3674,2020-05-07,1.0,607.186800,2018-12-04,520,195
132,3674,2020-05-15,1.0,607.186800,2018-12-04,528,195
133,3674,2020-05-17,1.0,610.743802,2018-12-04,530,195
134,3674,2020-06-08,1.0,610.743802,2018-12-04,552,195
135,3674,2020-06-25,1.0,610.743802,2018-12-04,569,195
136,3674,2020-09-06,1.0,555.221638,2018-12-04,642,195
137,3674,2020-09-11,1.0,555.221638,2018-12-04,647,195
138,3674,2020-09-18,1.0,555.221638,2018-12-04,654,195
139,3674,2020-09-20,1.0,555.221638,2018-12-04,656,195
140,3674,2020-09-23,1.0,555.221638,2018-12-04,659,195
141,3674,2020-09-26,1.0,555.221638,2018-12-04,662,195
142,3674,2020-10-08,1.0,555.221638,2018-12-04,674,195
143,3674,2020-10-11,1.0,555.221638,2018-12-04,677,195
144,3674,2020-11-04,1.0,555.221638,2018-12-04,701,195
145,3674,2020-11-23,1.0,555.221638,2018-12-04,720,195
146,3674,2020-11-25,1.0,555.221638,2018-12-04,722,195
147,3674,2020-11-29,1.0,555.221638,2018-12-04,726,195
148,3674,2020-12-07,1.0,333.801653,2018-12-04,734,195

In [126]:
df.groupby("id_product").order_date.max()

id_product
401       2021-01-23
416       2020-04-02
717       2019-03-10
778       2019-12-27
826       2020-02-19
             ...
1536841   2020-11-22
1536842   2020-11-24
1536887   2020-11-22
1536952   2021-01-26
1536974   2020-12-06
Name: order_date, Length: 498, dtype: datetime64[ns]

In [127]:
df.groupby("id_product").order_date.transform(max).dt.date

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: object

In [128]:
last_order_date = df.groupby("id_product").order_date.transform(max).dt.date

In [129]:
today = pd.to_datetime("27-02-2021", format='%d-%m-%Y').date()
print(today)

2021-02-27

In [130]:
today - last_order_date

0      35 days
1     331 days
2     720 days
3     428 days
4     374 days
        ...
906    95 days
907    95 days
908    97 days
909    32 days
910    83 days
Name: order_date, Length: 911, dtype: timedelta64[ns]

In [131]:
df["passing_time_from_lastsale"] = today - last_order_date

In [132]:
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale,passing_time_from_lastsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781,781,35 days
1,416,2020-04-02,1.0,131.181818,2018-12-04,485,485,331 days
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96,96,720 days
3,778,2019-12-27,1.0,335.988000,2018-12-04,388,388,428 days
4,826,2020-02-19,1.0,342.292302,2018-12-04,442,442,374 days
...,...,...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48,95 days
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48,95 days
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9,9,97 days
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63,63,32 days
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10,10,83 days

In [133]:
df["passing_time_from_lastsale"] = df["passing_time_from_lastsale"].astype("str").str.split(" ").str[0].astype(int)
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale,passing_time_from_lastsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781,781,35
1,416,2020-04-02,1.0,131.181818,2018-12-04,485,485,331
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96,96,720
3,778,2019-12-27,1.0,335.988000,2018-12-04,388,388,428
4,826,2020-02-19,1.0,342.292302,2018-12-04,442,442,374
...,...,...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48,95
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48,95
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9,9,97
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63,63,32
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10,10,83

In [134]:
df[(df.id_product == 3674)].sort_values("time_delta")

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale,passing_time_from_lastsale
116,3674,2019-06-17,1.0,528.988500,2018-12-04,195,195,82
117,3674,2020-01-08,1.0,551.988000,2018-12-04,400,195,82
118,3674,2020-01-13,1.0,551.988000,2018-12-04,405,195,82
119,3674,2020-01-23,1.0,551.988000,2018-12-04,415,195,82
120,3674,2020-01-28,1.0,551.988000,2018-12-04,420,195,82
121,3674,2020-02-16,1.0,607.186800,2018-12-04,439,195,82
122,3674,2020-02-21,1.0,607.186800,2018-12-04,444,195,82
123,3674,2020-03-06,1.0,607.186800,2018-12-04,458,195,82
124,3674,2020-03-08,1.0,607.186800,2018-12-04,460,195,82
125,3674,2020-03-09,1.0,607.186800,2018-12-04,461,195,82
126,3674,2020-03-14,1.0,607.186800,2018-12-04,466,195,82
127,3674,2020-04-12,1.0,607.186800,2018-12-04,495,195,82
128,3674,2020-04-20,1.0,607.186800,2018-12-04,503,195,82
129,3674,2020-04-23,2.0,607.186800,2018-12-04,506,195,82
130,3674,2020-04-26,1.0,607.186800,2018-12-04,509,195,82
131,3674,2020-05-07,1.0,607.186800,2018-12-04,520,195,82
132,3674,2020-05-15,1.0,607.186800,2018-12-04,528,195,82
133,3674,2020-05-17,1.0,610.743802,2018-12-04,530,195,82
134,3674,2020-06-08,1.0,610.743802,2018-12-04,552,195,82
135,3674,2020-06-25,1.0,610.743802,2018-12-04,569,195,82
136,3674,2020-09-06,1.0,555.221638,2018-12-04,642,195,82
137,3674,2020-09-11,1.0,555.221638,2018-12-04,647,195,82
138,3674,2020-09-18,1.0,555.221638,2018-12-04,654,195,82
139,3674,2020-09-20,1.0,555.221638,2018-12-04,656,195,82
140,3674,2020-09-23,1.0,555.221638,2018-12-04,659,195,82
141,3674,2020-09-26,1.0,555.221638,2018-12-04,662,195,82
142,3674,2020-10-08,1.0,555.221638,2018-12-04,674,195,82
143,3674,2020-10-11,1.0,555.221638,2018-12-04,677,195,82
144,3674,2020-11-04,1.0,555.221638,2018-12-04,701,195,82
145,3674,2020-11-23,1.0,555.221638,2018-12-04,720,195,82
146,3674,2020-11-25,1.0,555.221638,2018-12-04,722,195,82
147,3674,2020-11-29,1.0,555.221638,2018-12-04,726,195,82
148,3674,2020-12-07,1.0,333.801653,2018-12-04,734,195,82